In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "id": [1, 2, 3, 4, 5],
    "name": ["Ram", "Sam", "Gita","Sita","Hari"],
    "age": [10,20,30,40,50],
    "salary": ['NaN',20000,30000,40000,'NaN']
})

In [3]:
df

   age  id  name salary
0   10   1   Ram    NaN
1   20   2   Sam  20000
2   30   3  Gita  30000
3   40   4  Sita  40000
4   50   5  Hari    NaN

In [4]:
df = pd.DataFrame({
    "id": [1, 2, 3, 4, 5],
    "name": ["Ram", "Sam", "Gita","Sita","Hari"],
    "age": [10,20,30,40,50],
})

In [5]:
df

   age  id  name
0   10   1   Ram
1   20   2   Sam
2   30   3  Gita
3   40   4  Sita
4   50   5  Hari

In [6]:
df["salary"] = df["age"].apply(lambda age_value: 20000 if( age_value >10 and age_value<40) else None )

In [7]:
df

   age  id  name   salary
0   10   1   Ram      NaN
1   20   2   Sam  20000.0
2   30   3  Gita  20000.0
3   40   4  Sita      NaN
4   50   5  Hari      NaN

In [8]:
df['salary'] = df[df["age"].between(20, 40)].apply(lambda x: 5000)

In [9]:
df

   age  id  name  salary
0   10   1   Ram     NaN
1   20   2   Sam     NaN
2   30   3  Gita     NaN
3   40   4  Sita     NaN
4   50   5  Hari     NaN

In [10]:
df["salary"].apply(lambda sal: sal+5000 if pd.notnull(sal) else 5000)

0    5000
1    5000
2    5000
3    5000
4    5000
Name: salary, dtype: int64

In [11]:
df = pd.DataFrame({
"test1": [["a","b","c","c"],["e","f","g","h","i"]],
    "test2": [["a","b","c","d"],["k","l","m","n"]]
})

In [12]:
df

             test1         test2
0     [a, b, c, c]  [a, b, c, d]
1  [e, f, g, h, i]  [k, l, m, n]

In [13]:
set(df["test1"][0])

{'a', 'b', 'c'}

In [14]:
df["test1"]

0       [a, b, c, c]
1    [e, f, g, h, i]
Name: test1, dtype: object

In [15]:
def test(val):
    s = ''
    for items in val:
        if items not in s:
            s += items
    return ','.join(s)
        

df['test1'] = df['test1'].apply(test)
df['test2'] = df['test2'].apply(test)

In [16]:
df

       test1    test2
0      a,b,c  a,b,c,d
1  e,f,g,h,i  k,l,m,n

In [17]:
def test(row):
    print (row['test1'])
    exit()
        
df['test1'] = df.apply(test,1)

a,b,c
e,f,g,h,i